gradhocJcalvo/optee-graddeck/core/arch/arm/plat-stm32mp2/scmi_server_scpfw.c
	CLOCK_CELL(CK_SCMI_TIMG1, TIMG1_CK, "timg1_ck", true),
	CLOCK_CELL(CK_SCMI_TIMG2, TIMG2_CK, "timg2_ck", true),

	CLOCK_CELL(CK_SCMI_BKPSRAM, CK_BUS_BKPSRAM, "ck_bus_bkpsram", true),
	CLOCK_CELL(CK_SCMI_BSEC, CK_BUS_BSEC, "ck_bus_bsec", true),
	CLOCK_CELL(CK_SCMI_BUS_ETR, CK_BUS_ETR, "ck_icn_p_etr", true),
	CLOCK_CELL(CK_SCMI_FMC, CK_KER_FMC, "ck_ker_fmc", true),
	CLOCK_CELL(CK_SCMI_GPIOA, CK_BUS_GPIOA, "ck_bus_gpioa", true),
	CLOCK_CELL(CK_SCMI_GPIOB, CK_BUS_GPIOB, "ck_bus_gpiob", true),
	CLOCK_CELL(CK_SCMI_GPIOC, CK_BUS_GPIOC, "ck_bus_gpioc", true),
	CLOCK_CELL(CK_SCMI_GPIOD, CK_BUS_GPIOD, "ck_bus_gpiod", true),
	CLOCK_CELL(CK_SCMI_GPIOE, CK_BUS_GPIOE, "ck_bus_gpioe", true),
	CLOCK_CELL(CK_SCMI_GPIOF, CK_BUS_GPIOF, "ck_bus_gpiof", true),
	CLOCK_CELL(CK_SCMI_GPIOG, CK_BUS_GPIOG, "ck_bus_gpiog", true),
	CLOCK_CELL(CK_SCMI_GPIOH, CK_BUS_GPIOH, "ck_bus_gpioh", true),
	CLOCK_CELL(CK_SCMI_GPIOI, CK_BUS_GPIOI, "ck_bus_gpioi", true),
	CLOCK_CELL(CK_SCMI_GPIOJ, CK_BUS_GPIOJ, "ck_bus_gpioj", true),
	CLOCK_CELL(CK_SCMI_GPIOK, CK_BUS_GPIOK, "ck_bus_gpiok", true),
	CLOCK_CELL(CK_SCMI_GPIOZ, CK_BUS_GPIOZ, "ck_bus_gpioz", true),
	CLOCK_CELL(CK_SCMI_HPDMA1, CK_BUS_HPDMA1, "ck_bus_hpdma1", true),
	CLOCK_CELL(CK_SCMI_HPDMA2, CK_BUS_HPDMA2, "ck_bus_hpdma2", true),
	CLOCK_CELL(CK_SCMI_HPDMA3, CK_BUS_HPDMA3, "ck_bus_hpdma3", true),
	CLOCK_CELL(CK_SCMI_HSEM, CK_BUS_HSEM, "ck_bus_hsem", true),
	CLOCK_CELL(CK_SCMI_IPCC1, CK_BUS_IPCC1, "ck_bus_ipcc1", true),
	CLOCK_CELL(CK_SCMI_IPCC2, CK_BUS_IPCC2, "ck_bus_ipcc2", true),
	CLOCK_CELL(CK_SCMI_LPDMA, CK_BUS_LPDMA, "ck_bus_lpdma", true),
	CLOCK_CELL(CK_SCMI_RETRAM, CK_BUS_RETRAM, "ck_bus_retram", true),
	CLOCK_CELL(CK_SCMI_RTC, CK_BUS_RTC, "ck_bus_rtc", true),
	CLOCK_CELL(CK_SCMI_SRAM1, CK_BUS_SRAM1, "ck_bus_sram1", true),
	CLOCK_CELL(CK_SCMI_SRAM2, CK_BUS_SRAM2, "ck_bus_sram2", true),
	CLOCK_CELL(CK_SCMI_SYSCPU1, CK_BUS_SYSCPU1, "ck_bus_syscpu1", true),
	CLOCK_CELL(CK_SCMI_CPU1, CK_CPU1, "ck_cpu1", true),
	CLOCK_CELL(CK_SCMI_HSE_DIV2, HSE_DIV2_CK, "hse_div2_ck", false),
	CLOCK_CELL(CK_SCMI_PLL2, PLL2_CK, "ck_pll2", true),
	CLOCK_CELL(CK_SCMI_PLL3, PLL3_CK, "ck_pll3", false),
	CLOCK_CELL(CK_SCMI_LPSRAM1, CK_BUS_LPSRAM1, "ck_icn_lpsram1", true),
	CLOCK_CELL(CK_SCMI_LPSRAM2, CK_BUS_LPSRAM2, "ck_icn_lpsram2 ", true),
	CLOCK_CELL(CK_SCMI_LPSRAM3, CK_BUS_LPSRAM3, "ck_icn_lpsram3", true),
	CLOCK_CELL(CK_SCMI_VDERAM, CK_BUS_VDERAM, "ck_icn_s_vderam", true),
	CLOCK_CELL(CK_SCMI_SYSRAM, CK_BUS_SYSRAM, "ck_icn_s_sysram", true),
	CLOCK_CELL(CK_SCMI_OSPI1, CK_KER_OSPI1, "ck_ker_ospi1", true),
	CLOCK_CELL(CK_SCMI_OSPI2, CK_KER_OSPI2, "ck_ker_ospi2", true),
	CLOCK_CELL(CK_SCMI_TPIU, CK_KER_TPIU, "ck_ker_tpiu", true),
	CLOCK_CELL(CK_SCMI_SYSDBG, CK_SYSDBG, "ck_sys_dbg", true),
	CLOCK_CELL(CK_SCMI_SYSATB, CK_BUS_SYSATB, "ck_sys_atb", true),
	CLOCK_CELL(CK_SCMI_TSDBG, CK_KER_TSDBG, "ck_ker_tsdbg", true),
	CLOCK_CELL(CK_SCMI_KER_ETR, CK_KER_ETR, "ck_icn_m_etr", true),
	CLOCK_CELL(CK_SCMI_BUS_STM, CK_BUS_STM, "ck_icn_p_stm", true),
	CLOCK_CELL(CK_SCMI_KER_STM, CK_BUS_STM, "ck_icn_s_stm", true),
};
#endif

static struct stm32_scmi_rd stm32_scmi_reset[] = {
	RESET_CELL(RST_SCMI_C1_R, C1_R, 0, "c1"),
	RESET_CELL(RST_SCMI_C2_R, C2_R, 0, "c2"),
	RESET_CELL(RST_SCMI_C1_HOLDBOOT_R, C1_HOLDBOOT_R, 0, "c1_holdboot"),
	RESET_CELL(RST_SCMI_C2_HOLDBOOT_R, C2_HOLDBOOT_R, 0, "c2_holdboot"),
	/* SCMI FMC reset allowed: RCC driver stubs request if necessary */
	RESET_CELL(RST_SCMI_FMC, FMC_R, 0, "fmc"),
	RESET_CELL(RST_SCMI_OSPI1, OSPI1_R, OSPI1_BASE, "ospi1"),
#if (defined(CFG_STM32MP25) || defined(CFG_STM32MP23))
	RESET_CELL(RST_SCMI_OSPI2, OSPI2_R, OSPI2_BASE, "ospi2"),
#endif
	RESET_CELL(RST_SCMI_OSPI1DLL, OSPI1DLL_R, OSPI1_BASE, "ospi1_ddl"),
#ifdef CFG_STM32MP25
	RESET_CELL(RST_SCMI_OSPI2DLL, OSPI2DLL_R, OSPI2_BASE, "ospi2_ddl"),
#endif
};

static const struct channel_resources scmi_channel[] = {
	[0] = {
		.clock = stm32_scmi_clock,
		.clock_count = ARRAY_SIZE(stm32_scmi_clock),
		.rd = stm32_scmi_reset,
		.rd_count = ARRAY_SIZE(stm32_scmi_reset),
	},
};

/*
 * Platform clocks exposed with SCMI
 */
static struct clk plat_clocks[ARRAY_SIZE(stm32_scmi_clock)];

static TEE_Result plat_scmi_clk_get_rates_steps(struct clk *clk,
						unsigned long *min,
						unsigned long *max,
						unsigned long *step)
{
	struct stm32_scmi_clk *scmi_clk = clk->priv;

	if (scmi_clk->change_rate) {
		*min = 0;
		*max = UINT32_MAX;
		*step = 0;
	} else {
		*min = clk->rate;
		*max = *min;
		*step = 0;
	}

	return TEE_SUCCESS;
}

static const struct clk_ops plat_scmi_clk_ops = {
	.get_rates_steps = plat_scmi_clk_get_rates_steps,
};

static void get_scmi_clocks(void)
{
	size_t i = 0;

	for (i = 0; i < ARRAY_SIZE(stm32_scmi_clock); i++) {
		struct stm32_scmi_clk *scmi_clk = stm32_scmi_clock + i;
		struct clk *clk = plat_clocks + i;

		if (!scmi_clk->is_exposed) {
			/* Empty name clocks discarded by Linux kernel */
			scmi_clk->name = "";
			continue;
		}

		clk->ops = &plat_scmi_clk_ops;
		clk->priv = scmi_clk;
		clk->name = scmi_clk->name;
		clk->parent = stm32mp_rcc_clock_id_to_clk(scmi_clk->clock_id);
		assert(clk->parent);

		if (scmi_clk->change_rate)
			clk->flags = CLK_SET_RATE_PARENT;

		clk->flags |= CLK_DUTY_CYCLE_PARENT;

		if (clk_register(clk))
			panic();

		scmi_clk->clk = clk;
	}
}

/*
 * Platform reset controllers exposed with SCMI
 */
static struct rstctrl plat_resets[ARRAY_SIZE(stm32_scmi_reset)];

static TEE_Result plat_scmi_reset_assert_level(struct rstctrl *rstctrl,
					       unsigned int to_us)
{
	const struct stm32_firewall_cfg nsec_cfg[] = {
		{ FWLL_NSEC_PRIV_RW | FWLL_MASTER(0) },
		{ }, /* Null terminated */
	};
	int index = rstctrl - plat_resets;
	paddr_t domain_iobase = 0;
	unsigned long reset_id = 0;
	TEE_Result res = TEE_ERROR_GENERIC;

	assert(index >= 0 && (size_t)index < ARRAY_SIZE(stm32_scmi_reset));
	domain_iobase = stm32_scmi_reset[index].base;

	if (domain_iobase &&
	    stm32_firewall_check_access(domain_iobase, 0, nsec_cfg))
		return TEE_ERROR_ACCESS_DENIED;

	reset_id = stm32_scmi_reset[index].reset_id;

	if (reset_id == C2_R || reset_id == C2_HOLDBOOT_R) {
		res = stm32_rproc_reset_grant_access(STM32MP2_M33_RPROC_ID);
		if (res)
			return res;
	}

	return rstctrl_assert_to(stm32_scmi_reset[index].rstctrl_be, to_us);
}

static TEE_Result plat_scmi_reset_deassert_level(struct rstctrl *rstctrl,
						 unsigned int to_us)
{
	const struct stm32_firewall_cfg nsec_cfg[] = {
		{ FWLL_NSEC_PRIV_RW | FWLL_MASTER(0) },
		{ }, /* Null terminated */
	};
	int index = rstctrl - plat_resets;
	paddr_t domain_iobase = 0;
	unsigned long reset_id = 0;
	TEE_Result res = TEE_ERROR_GENERIC;

	assert(index >= 0 && (size_t)index < ARRAY_SIZE(stm32_scmi_reset));
	domain_iobase = stm32_scmi_reset[index].base;

	if (domain_iobase &&
	    stm32_firewall_check_access(domain_iobase, 0, nsec_cfg))
		return TEE_ERROR_ACCESS_DENIED;

	reset_id = stm32_scmi_reset[index].reset_id;

	if (reset_id == C2_R || reset_id == C2_HOLDBOOT_R) {
		res = stm32_rproc_reset_grant_access(STM32MP2_M33_RPROC_ID);
		if (res)
			return res;
	}

