gradhocJcalvo/optee-graddeck/core/arch/arm/plat-stm32mp2/scmi_server_scpfw.c
	return rstctrl_deassert_to(stm32_scmi_reset[index].rstctrl_be, to_us);
}

static const char *plat_scmi_reset_get_name(struct rstctrl *rstctrl)
{
	int index = rstctrl - plat_resets;

	assert(index >= 0 && (size_t)index < ARRAY_SIZE(stm32_scmi_reset));

	return rstctrl_name(stm32_scmi_reset[index].rstctrl_be);
}

static const struct rstctrl_ops plat_scmi_reset_ops = {
	.assert_level = plat_scmi_reset_assert_level,
	.deassert_level = plat_scmi_reset_deassert_level,
	.get_name = plat_scmi_reset_get_name,
};

static void get_scmi_resets(void)
{
	size_t i = 0;

	for (i = 0; i < ARRAY_SIZE(stm32_scmi_reset); i++) {
		struct stm32_scmi_rd *scmi_reset = stm32_scmi_reset + i;
		struct rstctrl *rstctrl = plat_resets + i;

		if (!scmi_reset->is_exposed) {
			/* SCP-firmware needs a name */
			scmi_reset->name = "<reserved>";
			continue;
		}

		rstctrl->ops = &plat_scmi_reset_ops;

		scmi_reset->rstctrl_be =
			stm32mp_rcc_reset_id_to_rstctrl(scmi_reset->reset_id);
		assert(scmi_reset->rstctrl_be);

		scmi_reset->rstctrl = rstctrl;
	}
}

/*
 * Build the structure used to initialize SCP firmware.
 * We target a description from the DT so SCP firmware configuration
 * but we currently rely on local data (clock, reset) and 2 DT node
 * (voltage domain/regulators and DVFS).
 *
 * At early_init initcall level, prepare scpfw_cfg agent and channel parts.
 * At driver_init_late initcall level, get clock and reset devices.
 * When scmi-regulator-consumer driver probes, it adds the regulators.
 * When CPU OPP driver probesn it adds the DVFS part.
 */
static struct scpfw_config scpfw_cfg;

struct scpfw_config *scmi_scpfw_get_configuration(void)
{
	assert(scpfw_cfg.agent_count);

	return &scpfw_cfg;
}

static TEE_Result scmi_scpfw_cfg_early_init(void)
{
	/* There is 1 agent with 1 channel */

	scpfw_cfg.agent_count = 1;
	scpfw_cfg.agent_config = calloc(scpfw_cfg.agent_count,
					sizeof(*scpfw_cfg.agent_config));

	scpfw_cfg.agent_config[0].name = "agent";
	scpfw_cfg.agent_config[0].agent_id = 1;
	scpfw_cfg.agent_config[0].channel_count = ARRAY_SIZE(scmi_channel);
	scpfw_cfg.agent_config[0].channel_config =
		calloc(scpfw_cfg.agent_config[0].channel_count,
		       sizeof(*scpfw_cfg.agent_config[0].channel_config));

	return TEE_SUCCESS;
}

early_init(scmi_scpfw_cfg_early_init);

static TEE_Result scmi_scpfw_cfg_init(void)
{
	struct scpfw_channel_config *channel_cfg = NULL;
	size_t i = 0;
	size_t j = 0;

	get_scmi_clocks();
	get_scmi_resets();

	for (i = 0; i < ARRAY_SIZE(scmi_channel); i++) {
		/* Clock and reset are exposed to agent#0/channel#0 */
		channel_cfg = scpfw_cfg.agent_config[0].channel_config + i;
		channel_cfg->name = "channel";

		channel_cfg->clock_count = ARRAY_SIZE(stm32_scmi_clock);
		if (channel_cfg->clock_count) {
			channel_cfg->clock =
				calloc(channel_cfg->clock_count,
				       sizeof(*channel_cfg->clock));

			for (j = 0; j < channel_cfg->clock_count; j++) {
				channel_cfg->clock[j] = (struct scmi_clock){
					.name = stm32_scmi_clock[j].name,
					.clk = stm32_scmi_clock[j].clk,
					/* Default OFF for RIF issues */
					.enabled = false,
				};
			}
		}

		channel_cfg->reset_count = ARRAY_SIZE(stm32_scmi_reset);
		if (channel_cfg->reset_count) {
			channel_cfg->reset =
				calloc(channel_cfg->reset_count,
				       sizeof(*channel_cfg->reset));

			for (j = 0; j < channel_cfg->reset_count; j++) {
				channel_cfg->reset[j] = (struct scmi_reset){
					.name = stm32_scmi_reset[j].name,
					.rstctrl = stm32_scmi_reset[j].rstctrl,
				};
			}
		}
	}

	/* DVFS will be populated from cpu_opp driver */

	if (IS_ENABLED(CFG_SCMI_SERVER_REGULATOR_CONSUMER)) {
		TEE_Result res = TEE_ERROR_GENERIC;

		res = scmi_regulator_consumer_init();
		if (res) {
			EMSG("SCMI regulator consumer init: %#"PRIx32, res);
			return res;
		}
	}

	return TEE_SUCCESS;
}

driver_init_late(scmi_scpfw_cfg_init);

void scmi_scpfw_release_configuration(void)
{
	struct scpfw_channel_config *channel_cfg = NULL;
	struct scpfw_agent_config *agent_cfg = NULL;
	size_t i = 0;
	size_t j = 0;
	size_t k = 0;

	for (i = 0; i < scpfw_cfg.agent_count; i++) {
		agent_cfg = scpfw_cfg.agent_config + i;

		for (j = 0; j < agent_cfg->channel_count; j++) {
			channel_cfg = agent_cfg->channel_config + j;

			free(channel_cfg->clock);
			free(channel_cfg->reset);
			free(channel_cfg->voltd);

			for (k = 0; k < channel_cfg->perfd_count; k++) {
				free(channel_cfg->perfd[k].dvfs_opp_khz);
				free(channel_cfg->perfd[k].dvfs_opp_mv);
			}

			free(channel_cfg->perfd);
		}

		free(agent_cfg->channel_config);
	}

	free(scpfw_cfg.agent_config);
}

static unsigned int voltd_id_count(struct scmi_server_regu *regu,
				   size_t regu_count)
{
	unsigned int max_id = 0;
	size_t i = 0;

	for (i = 0; i < regu_count; i++)
		max_id = MAX(max_id, regu[i].domain_id);

	return max_id + 1;
}

TEE_Result scmi_scpfw_cfg_add_regu(unsigned int agent_id,
				   unsigned int channel_id,
				   struct scmi_server_regu *regu,
				   size_t regu_count)
{
	struct scpfw_channel_config *channel_cfg = NULL;
	struct scpfw_agent_config *agent_cfg = NULL;
	size_t i = 0;

	agent_cfg = scpfw_cfg.agent_config + agent_id;
	channel_cfg = agent_cfg->channel_config + channel_id;

	if (!regu_count)
		return TEE_SUCCESS;

	if (agent_id >= scpfw_cfg.agent_count ||
	    channel_id >= agent_cfg->channel_count)
		return TEE_ERROR_BAD_PARAMETERS;

	if (channel_cfg->voltd) {
		EMSG("Voltage domain already loaded: agent %u, channel %u",
		     agent_id, channel_id);
		panic();
	}

	channel_cfg->voltd_count = voltd_id_count(regu, regu_count);
	channel_cfg->voltd = calloc(channel_cfg->voltd_count,
				    sizeof(*channel_cfg->voltd));
	assert(channel_cfg->voltd);

	for (i = 0; i < regu_count; i++) {
		unsigned int domain_id = regu[i].domain_id;

		if (regu[i].regulator) {
			channel_cfg->voltd[domain_id] = (struct scmi_voltd){
				.name = regulator_name(regu[i].regulator),
				.regulator = regu[i].regulator,
				.enabled = regu[i].enabled,
			};
		}
	}

	return TEE_SUCCESS;
}

TEE_Result scmi_scpfw_cfg_add_dvfs(unsigned int agent_id,
				   unsigned int channel_id,
				   unsigned int domain_id,
				   struct regulator *regulator, struct clk *clk,
				   unsigned int *dvfs_khz,
				   unsigned int *dvfs_mv, size_t dvfs_count,
				   size_t initial_index)
{
	struct scpfw_channel_config *channel_cfg = NULL;
	struct scpfw_agent_config *agent_cfg = NULL;
	unsigned int *dvfs_opp_khz = NULL;
	unsigned int *dvfs_opp_mv = NULL;

	agent_cfg = scpfw_cfg.agent_config + agent_id;
	channel_cfg = agent_cfg->channel_config + channel_id;

	if (agent_id >= scpfw_cfg.agent_count ||
	    channel_id >= agent_cfg->channel_count || !dvfs_count)
		return TEE_ERROR_BAD_PARAMETERS;

	dvfs_opp_khz = calloc(dvfs_count, sizeof(*dvfs_opp_khz));
	dvfs_opp_mv = calloc(dvfs_count, sizeof(*dvfs_opp_mv));
	if (!dvfs_opp_khz || !dvfs_opp_mv) {
		free(dvfs_opp_khz);
		free(dvfs_opp_mv);

		return TEE_ERROR_OUT_OF_MEMORY;
	}
	memcpy(dvfs_opp_khz, dvfs_khz, dvfs_count * sizeof(*dvfs_opp_khz));
	memcpy(dvfs_opp_mv, dvfs_mv, dvfs_count * sizeof(*dvfs_opp_mv));

	if (channel_cfg->perfd_count <= domain_id) {
		void *ptr = realloc(channel_cfg->perfd,
				    (domain_id + 1) *
				    sizeof(*channel_cfg->perfd));

		if (!ptr) {
			free(dvfs_opp_khz);
			free(dvfs_opp_mv);
			return TEE_ERROR_OUT_OF_MEMORY;
		}

		channel_cfg->perfd = ptr;
		memset(channel_cfg->perfd + channel_cfg->perfd_count, 0,
		       (domain_id + 1 - channel_cfg->perfd_count) *
		       sizeof(*channel_cfg->perfd));

		channel_cfg->perfd_count = domain_id + 1;
	}

	assert(!channel_cfg->perfd->dvfs_opp_khz);

	channel_cfg->perfd[domain_id] = (struct scmi_perfd){
		.name = "DVFS",
		.initial_opp = initial_index,
		.dvfs_opp_count = dvfs_count,
		.dvfs_opp_khz = dvfs_opp_khz,
		.dvfs_opp_mv = dvfs_opp_mv,
		.clk = clk,
		.regulator = regulator,
	};

	return TEE_SUCCESS;
}
